syllabus.md


# General Course Information

-   Meeting Times: Tuesday & Thursday, 14:30-15:45 hrs
-   Meeting place: Derby 239
-   Professor: Marcus Birkenkrahe
-   Office: Derby 210
-   Phone: (501) 422-4725
-   Office hours: Mon/Wed/Fri 10:00-10:30 AM; Tue/Thu 4-4:30 PM
-   Text: *Model Thinking: What You Need To Make Data Work For You*,
    by Scott E. Page, Reprint edition, Basic Books (March 16,
    2021). ([Amazon](https://www.amazon.com/Model-Thinker-What-Need-Know/dp/1541675711/))


## Objectives

Models are abstractions that explain parts of the real world,
e.g. to address, if not solve, complex problems like climate
change, pandemics, or space exploration. Since the real world is
only accessible to us through observation, observable data are key
to building, verifying and using models. To support
decision-making, data and processes are mined and modeled. In this
course, we will explore model thinking and a wide array of data and
process modeling tools. This special topic seminar is for everyone
who is interested in using models and modeling languages to better
understand the challenges and achievements of modeling.


## Student Learning Outcomes

Students who complete DSC 482.02 are able to:

-   Understand data and process modeling challenges
-   Use a variety of modeling languages to create models
-   Make use of different modeling software environments
-   Understand, and can present current modeling research
-   Apply modeling tools to an area of their knowledge
-   Write a scientific (IMRaD) essay on modern modeling methods


## Course requirements

No prior knowledge required. Experience and knowledge of data or
process modeling methods (e.g. Entity Relationship Diagrams, or
Unified Modeling Language) is useful but not critical. Curiosity
and active participations, especially during classroom
presentations and discussion, is important. You will gain advanced
data and process literacy skills by taking this course.


## Grading system

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">When</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-right">Impact</th>
<th scope="col" class="org-left">Graded</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">TBD</td>
<td class="org-left">Final exam</td>
<td class="org-right">40%</td>
<td class="org-left">Yes</td>
</tr>


<tr>
<td class="org-left">Last week</td>
<td class="org-left">Final essay</td>
<td class="org-right">30%</td>
<td class="org-left">Yes</td>
</tr>


<tr>
<td class="org-left">Weekly lab</td>
<td class="org-left">Practice</td>
<td class="org-right">15%</td>
<td class="org-left">No</td>
</tr>


<tr>
<td class="org-left">Weekly lab</td>
<td class="org-left">Participation</td>
<td class="org-right">15%</td>
<td class="org-left">No</td>
</tr>
</tbody>
</table>


### Grading table

This table is used to convert completion rates into letter
grades. For the midterm results, letter grades still carry signs,
while for the term results, only straight letters are given (by
rounding up).

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">**%**</th>
<th scope="col" class="org-left">**Midterm Grade**</th>
<th scope="col" class="org-left">**Final Grade**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">100-98</td>
<td class="org-left">A+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">97-96</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
</tr>


<tr>
<td class="org-right">95-90</td>
<td class="org-left">A-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">89-86</td>
<td class="org-left">B+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">85-80</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-right">79-76</td>
<td class="org-left">B-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">75-70</td>
<td class="org-left">C+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">69-66</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
</tr>


<tr>
<td class="org-right">65-60</td>
<td class="org-left">C-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">59-56</td>
<td class="org-left">D+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">55-50</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">49-0</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>
</tbody>
</table>


### Final exam (30%)

-   Complete multiple choice questions
-   Question examples at the start of a new week
-   Open book exam, 120 minutes


### Final essay (40%)

-   Review a book based on a model or method, OR
-   Review an research article based on a model or method, OR
-   Apply model(s) or method(s) to an area of your knowledge
-   Essay length: 15-20 pages (5,000-8,000 words)


### Weekly practice (15%)

-   Create a glossary of technical terms & present, AND
-   Connect session content to personal domain knowledge, AND
-   Complete set lab exercises in class


### Weekly participation (15%)

-   Participate in group discussions, OR
-   Participate in class discussion, OR
-   Present a glossary term, OR
-   Present a personal model application


## Grading examples


### Example - Midterm grade

At midterms, student X has achieved the following results:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Grade part**</th>
<th scope="col" class="org-right">**Weight**</th>
<th scope="col" class="org-right">**Result**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Weekly practice</td>
<td class="org-right">15%</td>
<td class="org-right">80%</td>
</tr>


<tr>
<td class="org-left">Weekly participation</td>
<td class="org-right">15%</td>
<td class="org-right">90%</td>
</tr>
</tbody>
</table>

Student X's midterm result is a "B" (`85%`).


### Example - Final grade

After the finals, student X has achieved the following results:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Grade part**</th>
<th scope="col" class="org-right">**Weight**</th>
<th scope="col" class="org-right">**Result**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Final exam</td>
<td class="org-right">30%</td>
<td class="org-right">95%</td>
</tr>


<tr>
<td class="org-left">Final essay</td>
<td class="org-right">40%</td>
<td class="org-right">95%</td>
</tr>


<tr>
<td class="org-left">Weekly practice</td>
<td class="org-right">15%</td>
<td class="org-right">80%</td>
</tr>


<tr>
<td class="org-left">Weekly participation</td>
<td class="org-right">15%</td>
<td class="org-right">90%</td>
</tr>
</tbody>
</table>

Student X's midterm result is an "A" (`92%`).


# Standard Policies


## Honor Code

All graded work in this class is to be pledged in accordance with
the Lyon College Honor Code. The use of a phone for any reason
during the course of an exam is considered an honor code
violation.
