syllabus.md


## Schedule and session content

-   Mini lectures on given topics are followed by discussion
-   Lab sessions involve in-class exercises and challenges
-   There's a short test at the beginning of every week
-   There's not one text book for all class topics
-   Bring articles, models, applications to class for discussion

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Lectures/Glossary/Labs</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">17-Aug</td>
<td class="org-left">Course overview & purpose</td>
</tr>


<tr>
<td class="org-left">19-Aug</td>
<td class="org-left">Many-model thinking (lab)</td>
</tr>


<tr>
<td class="org-left">24-Aug</td>
<td class="org-left">Why model?</td>
</tr>


<tr>
<td class="org-left">26-Aug</td>
<td class="org-left">Why model? (lab)</td>
</tr>


<tr>
<td class="org-left">31-Aug</td>
<td class="org-left">Many-model science</td>
</tr>


<tr>
<td class="org-left">2-Sep</td>
<td class="org-left">Many-model science (lab)</td>
</tr>


<tr>
<td class="org-left">7-Sep</td>
<td class="org-left">Modeling human actors</td>
</tr>


<tr>
<td class="org-left">9-Sep</td>
<td class="org-left">Modeling human actors (lab)</td>
</tr>


<tr>
<td class="org-left">14-Sep</td>
<td class="org-left">Process management & EPCs</td>
</tr>


<tr>
<td class="org-left">16-Sep</td>
<td class="org-left">Process management & EPCs (lab)</td>
</tr>


<tr>
<td class="org-left">21-Sep</td>
<td class="org-left">Business Process Model and Notation</td>
</tr>


<tr>
<td class="org-left">23-Sep</td>
<td class="org-left">BPMN (lab)</td>
</tr>


<tr>
<td class="org-left">28-Sep</td>
<td class="org-left">Performance management & Analytics</td>
</tr>


<tr>
<td class="org-left">30-Sep</td>
<td class="org-left">PM & Analytics (lab)</td>
</tr>


<tr>
<td class="org-left">7-Oct</td>
<td class="org-left">Distribution models (lab)</td>
</tr>


<tr>
<td class="org-left">12-Oct</td>
<td class="org-left">Linear models</td>
</tr>


<tr>
<td class="org-left">14-Oct</td>
<td class="org-left">Linear models (lab)</td>
</tr>


<tr>
<td class="org-left">19-Oct</td>
<td class="org-left">Agile management</td>
</tr>


<tr>
<td class="org-left">21-Oct</td>
<td class="org-left">Agile management (lab)</td>
</tr>


<tr>
<td class="org-left">26-Oct</td>
<td class="org-left">Models of value and power</td>
</tr>


<tr>
<td class="org-left">28-Oct</td>
<td class="org-left">Models of value and power (lab)</td>
</tr>


<tr>
<td class="org-left">2-Nov</td>
<td class="org-left">Unified Modeling Language (UML)</td>
</tr>


<tr>
<td class="org-left">4-Nov</td>
<td class="org-left">UML (lab)</td>
</tr>


<tr>
<td class="org-left">9-Nov</td>
<td class="org-left">Robotic process automation (RPA)</td>
</tr>


<tr>
<td class="org-left">11-Nov</td>
<td class="org-left">RPA (lab)</td>
</tr>


<tr>
<td class="org-left">16-Nov</td>
<td class="org-left">Non-linear models</td>
</tr>


<tr>
<td class="org-left">18-Nov</td>
<td class="org-left">Non-linear models (lab)</td>
</tr>


<tr>
<td class="org-left">23-Nov</td>
<td class="org-left">Process mining</td>
</tr>


<tr>
<td class="org-left">30-Nov</td>
<td class="org-left">COVID-19 models</td>
</tr>


<tr>
<td class="org-left">2-Dec</td>
<td class="org-left">Summary and outlook</td>
</tr>
</tbody>
</table>

